{ 
    "_id" : ObjectId("5dba4b4e981a7f003407dd69"), 
    "schoolId" : ObjectId("5d9b313faf98270031450073"), 
    "title" : "Neeu Atbe Revoisn red SiO-Pap: Gbaanbe itm Anhängen nnu öglimch", 
    "content" : "<p>In der aktuellen Beta-Version der HPI Schul-Cloud iOS App hat sich einiges verändert, wie auch im Update der <a href=\"https://blog.schul-cloud.org/android-app-dateien/\">Android App</a> stand die Überarbeitung des \"Dateien\"-Bereichs im Fokus.</p>\r\n\r\n<p>Bereits in der Vorgängerversion der App wurde der Dateien-Bereich der HPI Schul-Cloud zu den Speicherorten des mobilen Geräts hinzugefügt. So können Dateien einfach gefunden, heruntergeladen und gespeichert werden.</p>\r\n\r\n<p>Das aktuelle Update der App ermöglicht nun auch das Anhängen von Dateien an die Abgaben der Hausaufgaben sowie das Anzeigen dieser Anhänge direkt in der App. Außerdem wurde die Ansicht des Kalenders überarbeitet, sodass Details einzelner Einträge sichtbar sind.</p>\r\n\r\n<p>Eine weitere Optimierung fand im Kursbereich statt: Einzelne Themen werden nun umfangreicher dargestellt. Die HPI Schul-Cloud iOS App kann bereits im Schulalltag eingesetzt werden – downloadbar auf <a href=\"https://testflight.apple.com/join/7i2xn7hh\">TestFlight</a>.</p>\r\n", 
    "creatorId" : ObjectId("5db0b6b49f75de0031cc0505"), 
    "updaterId" : null, 
    "source" : "internal", 
    "createdAt" : ISODate("2019-10-31T02:47:42.367+0000"), 
    "displayAt" : ISODate("2019-10-31T02:47:42.434+0000"), 
    "__v" : 0.0
}
{ 
    "_id" : ObjectId("5dba4c1b2f37a70027bcbad8"), 
    "schoolId" : ObjectId("5d9b313faf98270031450073"), 
    "title" : "Eid HPI Chuls-Loucd las Infrsarsktuur rüf eid Lnerdä", 
    "content" : "<p>Die HPI Schul-Cloud kann und sollte nach unserer Meinung durchaus als länderübergreifend nutzbare Plattform etabliert werden. Die erreichbaren Synergieeffekte und der in allen digitalen Infrastrukturen zu beobachtende Skaleneffekt sprechen eindeutig dafür. Durch das föderale deutsche Bildungssystem ergeben sich hierbei teilweise divergente Anforderungen, bedingt durch unterschiedliche Zielsetzungen, Gesetzeslagen und Bestandssysteme in den jeweiligen Ländern.</p>\r\n\r\n<p>Es gilt also hinter einem ohnehin leicht anpassbaren Erscheinungsbild die <strong>individuellen Anforderungen der Länder</strong> zu berücksichtigen und zu realisieren. Neben neu bereitzustellenden Diensten und Modulen gilt es, bereits bestehende Lösungen, welche auch künftig genutzt werden sollen, in die Architektur zu integrieren.</p>\r\n\r\n<p>Damit die HPI Schul-Cloud diesem Anspruch gerecht werden kann und länderübergreifend als einheitliche Applikation einsetzbar ist, muss ein architektonischer Ansatz gewählt werden, der es erlaubt, den unterschiedlichen Anforderungen leicht gerecht werden zu können. Erreicht wird dies durch moderne Softwarearchitekturen und einen <strong>modularen Aufbau</strong> des Systems. Die einzelnen Dienste werden dabei als Microservices bereitgestellt.</p>\r\n", 
    "creatorId" : ObjectId("5db0b6b49f75de0031cc0505"), 
    "updaterId" : ObjectId("5db9ed302f37a70027bcbace"), 
    "source" : "internal", 
    "createdAt" : ISODate("2019-10-31T02:51:07.591+0000"), 
    "displayAt" : ISODate("2019-10-31T02:51:00.000+0000"), 
    "__v" : 0.0, 
    "updatedAt" : ISODate("2019-11-06T13:26:20.171+0000")
}
{ 
    "_id" : ObjectId("5dba4c3c2f37a70027bcbad9"), 
    "schoolId" : ObjectId("5d9b313faf98270031450073"), 
    "title" : "Wtllroeve Shsneiwei üreb Kheacr-Vhrlateen nfgdeune", 
    "content" : "<p>Das Bundesamt für Datensicherheit (BSI) der deutschen Regierung hat eine Sondereinheit ins Leben gerufen, welche sich auf die Identifizierung von Hackern spezialisiert hat. Dr. Brunk, der Leiter der Einheit, konnte bereits einige wertvolle Hinweise über das Hacker-Verhalten weitergeben: „Viele Hacker verschlüsseln ihre Angriffe mit sogenannten Master-Passwörtern. Nur wenn es gelingt, das Master-Passwort eines Hackers zu entschlüsseln, kann man einen Hacker-Angriff vollständig abwehren.“ Dabei ist Dr. Brunk ein Hacker besonders aufgefallen, der in letzter Zeit mehrfach Angriffe auf digitale Schulplattformen unternommen hat: „Bei diesem Hacker ergaben unsere Recherchen, dass er mit sehr großer Wahrscheinlichkeit ein Super-Passwort benutzt, welches seinen Lieblingsgegenstand beschreibt. Sobald man herausfinden kann, was der Lieblingsgegenstand des Hackers ist und diesen Begriff an unsere Sondereinheit weiterleitet, kann der Angriff überwunden werden.“ </p>\r\n", 
    "creatorId" : ObjectId("5db0b6b49f75de0031cc0505"), 
    "updaterId" : ObjectId("5db9ed302f37a70027bcbace"), 
    "source" : "internal", 
    "createdAt" : ISODate("2019-10-31T02:51:40.396+0000"), 
    "displayAt" : ISODate("2019-10-31T02:51:00.000+0000"), 
    "__v" : 0.0, 
    "updatedAt" : ISODate("2019-11-20T14:52:33.409+0000")
}
{ 
    "_id" : ObjectId("5dba4ccd7cb9850028c8a14d"), 
    "schoolId" : ObjectId("5d9b313faf98270031450073"), 
    "title" : "Atuchng Eufreaalrm!", 
    "content" : "<p>Griaß di God, ich bin Christian, 19 Jahre alt und Praktikant am Hasso-Plattner-Institut beim HPI Schul-Cloud-Team. Zu meinen ersten Aufgaben gehörte es, die Lampe des Feueralarms zu automatisieren – keine Sorge, es geht hierbei um kein echtes Feuer.</p>\r\n\r\n<p>Feueralarm – so nennen wir im Team Probleme, Fehler oder Bugs, welche oberste Priorität haben, da sie die Benutzung der HPI Schul-Cloud einschränken oder diese im schlimmsten Fall unbrauchbar machen.</p>\r\n\r\n<p>Die Idee hinter der Lampe ist es, das Entwicklerteam direkt über das neue Problem zu informieren, um es schnellstmöglich lösen zu können.</p>\r\n\r\n<p>Die technische Umsetzung habe ich dabei relativ schlicht gehalten. Die Kennleuchte ist an eine Funksteckdose angeschlossen, welche sich über eine Frequenz von 433 MHz ansteuern lässt. Zum Ansteuern habe ich ein einsprechendes Sendermodul an einem Raspberry Pi angeschlossen und für den Pi ein kleines Programm geschrieben. Dieses durchsucht das Ticketsystem, in dem alle Entwicklungsaufgaben erfasst werden, nach neuen Feueralarmen. Ist ein Feueralarm im System erstellt worden, so wird dieser kurz darauf erkannt und der Pi schickt über Funk den entsprechenden Befehl zum Einschalten der Steckdose –  und die Lampe leuchtet auf.  Damit die Lampe wieder ausgeht, muss sich ein Entwickler im System als Bearbeiter des Feueralarms eintragen.</p>\r\n\r\n<p>Ich freue mich, dass die Idee im Team so gut aufgenommen wurde, trotzdem hoffe ich natürlich, dass die Lampe nicht oft leuchtet.<br />\r\nIn meiner nächsten Aufgabe unterstütze ich den User-Support, indem ich bei der Entwicklung eines neuen Helpdesk helfen darf.</p>\r\n", 
    "creatorId" : ObjectId("5db0b6b49f75de0031cc0505"), 
    "updaterId" : ObjectId("5db9ed302f37a70027bcbace"), 
    "source" : "internal", 
    "createdAt" : ISODate("2019-10-31T02:54:05.298+0000"), 
    "displayAt" : ISODate("2019-10-31T02:54:00.000+0000"), 
    "__v" : 0.0, 
    "updatedAt" : ISODate("2019-11-06T13:25:30.846+0000")
}
{ 
    "_id" : ObjectId("5dba4e52981a7f003407dd6b"), 
    "schoolId" : ObjectId("5d9b313faf98270031450073"), 
    "title" : "Raleese \"Pirtye\" – Oabondnirg & Arimattidoisnn", 
    "content" : "<p>Das 16. Release heißt <em>Pyrite</em> - ein Edelstein, der auch als Katzengold bekannt ist. Selbst nicht hoch gehandelt, weist es jedoch oft auf Goldvorkommen in der Nähe hin. Große Teile unserer Entwickler arbeiten weiterhin an dem „Teams“-Bereich zu <strong>schulinternen und -übergreifenden Kommunikation</strong> und an einem neuen Werkzeug zur Themenerstellung. Zwei Goldschätze, die wir schon bald heben werden. In der Zwischenzeit freuen wir uns, folgende Funktionen in einem Release bündeln zu dürfen:</p>\r\n\r\n<p>Willkommensscreens für neue Kursnutzer</p>\r\n\r\n<p>Onboarding, das Heranführen von Nutzer*innen in neue Umgebungen, erleichtert neuen Nutzer*innen den Einstieg. Als ersten Schritt in diese Richtung nimmt einen die HPI Schul-Cloud nun an ersten Stellen an die Hand.</p>\r\n\r\n<p>Neue Grundlage für das Dateisystem</p>\r\n\r\n<p>Das Dateisystem der HPI Schul-Cloud ist auf neue Füße gestellt. Das ermöglicht uns in Zukunft, neue Funktionen wie beispielsweise ein erweitertes Rechtemanagement zu implementieren. Zusätzlich wurde die <strong>Dateiansicht leicht überarbeitet</strong>, um in einem ersten Schritt die bessere Lesbarkeit langer Datei und Ordnernamen zu gewährleisten.</p>\r\n\r\n<p>Anbindung des Schul-LDAPS im Self-Service</p>\r\n\r\n<p>Schulen können Ihre Nutzer*innen nun per LDAP mit der HPI Schul-Cloud synchronisieren. Dazu steht im Adminbereich eine <strong>Oberfläche zur Einrichtung</strong> der Anbindung bereit. Bestehende Nutzerinnen, die bereits in der HPI Schul-Cloud angelegt sind, werden nicht über das LDAP synchronisiert, hier sorgt die E-Mail-Adresse für einen Dopplungsausschluss.</p>\r\n\r\n<p>CSV-Import um Klassen erweitert</p>\r\n\r\n<p>Wer seine Nutzer*innen nicht per LDAP, sondern lieber per CSV-Datei einpflegt kann nun Klassen angeben. Die Klassen werden, falls noch nicht vorhanden, vom System angelegt und die Nutzer*innen automatisch hinzugefügt.</p>\r\n\r\n<p>Überarbeitung des Alters für die Einverständnis- erklärung und Entfernung des Forschungsvorhabens</p>\r\n\r\n<p>Dank DSGVO konnten wir das Alter für die selbstständige Einwilligungserklärung der Schüler*innen ohne ihre Eltern von 18 auf 16 Jahre senken. SuS ab 16 Jahre können nun die HPI Schul-Cloud ohne Einwilligung ihrer Eltern nutzen. Ausserdem verzichten wir im Sinne der Datensparsamkeit auf die Abfrage nach dem Geschlecht. Damit wird sämtliche Forschung nun nur noch anonymisiert betrieben und ist somit nicht zustimmungspflichtig - aus vier Häkchen mach drei!</p>\r\n\r\n<p>Bugfixes und kleine Verbesserungen</p>\r\n\r\n<p>Und wie immer konnten wir, Dank der Meldungen unserer Lehrkräfte und Schüler*innen, Probelme in der HPI Schul-Cloud identifizieren und beheben. Vielen Dank an unsere Nutzer*innen für das Feedback! Dazu noch ein Tipp: Den schnellsten Weg um uns ein Problem oder einen Wunsch zu melden, erreicht man einfach über den Hilfebutton in der HPI Schul-Cloud, unser User-Support kümmert sich dann zügig darum. Hierfür haben wir hinter den Kulissen unsere Testabläufe weiter verbessert.</p>\r\n", 
    "creatorId" : ObjectId("5db0b6b49f75de0031cc0505"), 
    "updaterId" : ObjectId("5db9ed302f37a70027bcbace"), 
    "source" : "internal", 
    "createdAt" : ISODate("2019-10-31T03:00:34.856+0000"), 
    "displayAt" : ISODate("2019-10-31T03:00:00.000+0000"), 
    "__v" : 0.0, 
    "updatedAt" : ISODate("2019-11-06T13:24:55.753+0000")
}
{ 
    "_id" : ObjectId("5dba4eac981a7f003407dd6c"), 
    "schoolId" : ObjectId("5d9b313faf98270031450073"), 
    "title" : "Uneer LADP Slef-Isicerve", 
    "content" : "<p>Die administrativen Funktionen der HPI Schul-Cloud haben sich mit dem <a href=\"https://blog.schul-cloud.org/release-quarz/\">Release „Quarz“</a> noch einmal erweitert. So gibt es nun für Administratoren die Möglichkeit, ein bestehendes Schul-LDAP-System mit unserem Self-Service an die HPI Schul-Cloud anzubinden.</p>\r\n\r\n<p>LDAP für den Login und die Stammdatenverwaltung in der Schul-Cloud zu benutzen war bisher immer mit zeitaufwändiger Absprache und manueller Konfiguration seitens des HPI Schul-Cloud Teams verbunden. Ein neuer Self-Service schafft hier Abhilfe und ermöglicht eine einfache und verzögerungsfreie Anbindung direkt aus der Schule heraus.</p>\r\n\r\n<p>Der LDAP-Self-Service kann über den Punkt Authentifizierung in der Schulverwaltung erreicht werden. Bitte beachtet, dass es sich hier um eine Expertenfunktion der HPI Schul-Cloud handelt, die einen sicheren Umgang mit der LDAP-Konfiguration voraussetzt. Benutzt den LDAP-Self-Service nur, wenn ihr sicher seid was ihr erreichen wollt.</p>\r\n\r\n<p>Folgende Voraussetzungen müssen auf Schulseite für die LDAP-Anbindung an die HPI Schul-Cloud erfüllt sein:</p>\r\n\r\n<p>Euer LDAP muss über das LDAPS-Protokoll erreichbar sein (mit SSL/TLS verschlüsselt)</p>\r\n\r\n<p>Euer LDAP-Server muss durch die HPI Schul-Cloud erreichbar sein (Firewall / IP-Freigaben)</p>\r\n\r\n<p>Es wird ein sog. Search-User benötigt, den Ihr im Self-Service hinterlegen könnt. Dieser Nutzer muss lesenden Zugriff auf alle Daten haben, die ihr synchronisieren wollt und sollte auf keinen Fall schreibenden Zugriff haben.</p>\r\n", 
    "creatorId" : ObjectId("5db0b6b49f75de0031cc0505"), 
    "updaterId" : ObjectId("5db9ed302f37a70027bcbace"), 
    "source" : "internal", 
    "createdAt" : ISODate("2019-10-31T03:02:04.301+0000"), 
    "displayAt" : ISODate("2019-10-31T03:02:00.000+0000"), 
    "__v" : 0.0, 
    "updatedAt" : ISODate("2019-11-06T13:24:15.726+0000")
}
{ 
    "_id" : ObjectId("5dba4f3b7cb9850028c8a14e"), 
    "schoolId" : ObjectId("5d9b313faf98270031450073"), 
    "title" : "Tim Reaelse \"Ruby\" ba isn euen Uschahljr!", 
    "content" : "<p>Mit dem neunzehnten Release „Ruby“ haben wir uns vor allem auf den Start in das neue Schuljahr konzentriert. Hilfreiche neue Funktionen warten auf unsere Lehrkräfte und Schüler.</p>\r\n\r\n<p>Kurse archivieren & Kurse importieren/duplizieren</p>\r\n\r\n<p>Kurse, deren Enddatum erreicht ist, werden ab sofort automatisch ins Kurs-Archiv verschoben. So sind alle aktuellen Kurse immer übersichtlich im Kurs Dashboard zu finden. Zusätzlich haben wir die Funktionen ‚Kurs importieren‘ und ‚Kurs duplizieren‘ (vormals ‚klonen‘) robuster gemacht.</p>\r\n\r\n<p>Nutzung der HPI Schul-Cloud mit analoger Einverständniserklärung verbessert</p>\r\n\r\n<p>Wir freuen uns, im neuen Schuljahr auch einige Grundschulen in der <a href=\"https://blog.schul-cloud.org/brandenburg-schuljahresstart-schul-cloud/\">Schul-Cloud Brandenburg</a> begrüßen zu dürfen. Viele davon möchten die Einverständniserklärung der Eltern auf dem Papierweg einholen. Daraufhin haben wir den „analogen“ Ablauf vereinfacht:</p>\r\n\r\n<p>Komfortfunktion für die analoge Einverständniserklärung bei ganzen Klassen</p>\r\n\r\n<p>einfaches Generieren von Startpasswörten inklusive praktischer Listen-Druckfunktion</p>\r\n\r\n<p>Schüler-Anmeldung auch möglich mit nicht funktionaler E-Mail-Adresse</p>\r\n\r\n<p> </p>\r\n\r\n<p>Das neue Schuljahr ist in der HPI Schul-Cloud gestartet</p>\r\n\r\n<p>Das Schuljahr 2019/20 ist da und kann beim neu Anlegen von Klassen oder beim Update der Klassenzugehörigkeit via erneutem csv-import der Schülerdaten inkl. Klasse angewählt werden.</p>\r\n", 
    "creatorId" : ObjectId("5db0b6b49f75de0031cc0505"), 
    "updaterId" : ObjectId("5db9ed302f37a70027bcbace"), 
    "source" : "internal", 
    "createdAt" : ISODate("2019-10-31T03:04:27.891+0000"), 
    "displayAt" : ISODate("2019-10-31T03:04:00.000+0000"), 
    "__v" : 0.0, 
    "updatedAt" : ISODate("2019-11-06T13:27:07.355+0000")
}
